[
  {
    "slug": 14,
    "heading": "Backpack Rover",
    "infoText": "A remote-operated vehicle specifically for military purposes. A soldier can carry it in his backpack and deploy it to a location that is out of sight and enables the unit to avoid a rigged explosive device. This robot is tougher and robust and can even relay live video feedback to the operator via radio transmission. This rover was also used to trace leopards that had wandered on the campus, has also been proposed to have potential to mitigate poaching incidents, man-animal conflicts, and help forest services.",
    "imageLink": "projects/backpack-rover.png",
    "imageDescription": "Backpack Rover"
  },
  {
    "slug": 1,
    "heading": "Electric All Terrain Vehicle",
    "infoText": "The bot was designed to carry a payload of 200kg while following a human soldier and move on audio commands for unmanned scouting and surveillance for dangerous tasks such as mine detection before the entry of human soldiers. These tasks can be carried out by target detection and tracking using computer vision and path planning algorithms for smooth movement. The designing purpose of this remote control EATV is to manufacture a vehicle prototype that provides help in supplying food in affected areas and to carry payload for the army.",
    "imageLink": "projects/eatv.png",
    "imageDescription": "Electric All Terrain Vehicle"
  },
  {
    "slug": 2,
    "heading": "Self Balancing Arm",
    "infoText": "The aim of this project was to build a Self-Levelling Arm that adjusts itself in a horizontal position, even in the presence of external disturbances, using a PID controller. The horizontal angular position was measured using an IMU (alternatively, a potentiometer attached to the fulcrum could be used). The angular error was passed into an Arduino UNO, which used a PID loop to drive two Brushless motors at the ends at varying speeds, thus balancing the arm.",
    "imageLink": "projects/self-balancing-arm.png",
    "imageDescription": "Self balancing arm"
  },
  {
    "slug": 3,
    "heading": "Indoor Navigation Robot",
    "infoText": "The main objective of this robot is to autonomously travel on the premises and do basic tasks, avoiding any dynamic obstacle that comes in its path by relying on vision and wheel odometer information. We can manually move the robot with the help of keyboard keys or a joystick using appropriate motors and a motor controller. Kalman filters and particle filters were the methods of localization that were employed. We also performed SLAM, path planning algorithms like Dijkstra’s and A-Star and also implemented PID control on the bot.",
    "imageLink": "projects/indoor-navigation-robot.png",
    "imageDescription": "Indoor Navigation Robot"
  },
  {
    "slug": 4,
    "heading": "Caligraphy Robot",
    "infoText": "The Calligraphy Robot is a system that can accept inputs/commands from a computer, via USB or Serial link, and write the characters accordingly. The main controller subsystem can interpret and communicate the limits of any given alphabet. It can also control the movement of the attachable end effector (here, a pen). The framework of the system is set up by the mechanical subsystem. The motion of the end effector along the X and Y axes is achieved by a belt drive operated by stepper motors. Movement along the z-axis is controlled using a solenoid puller.",
    "imageLink": "projects/calligraphy-robot.png",
    "imageDescription": "Calligraphy Robot"
  },
  {
    "slug": 5,
    "heading": "Kinect based Obstacle Avoider Robot",
    "infoText": "Kinect based obstacle avoider robot uses the Kinect Xbox 360 sensor for getting the feed of the environment around the robot in 3D raw data. This raw data is transformed into an RGB image with the help of CL NUI Kinect drivers. Robot gets the controlling signals after processing the RGB image using OpenCV libraries OpenCV is mostly used for image processing and object tracking. The IDEs used for writing programs are Visual Studio and Programmer’s Notepad. The Serial communication between compute and micro-controller was established using RS232 the micro-controller used is Atmega128",
    "imageLink": "projects/kinect-boa-robot.jpg",
    "imageDescription": "Kinect based Obstacle Avoider Robot"
  },
  {
    "slug": 6,
    "heading": "Snake Bot",
    "infoText": "Snake Robots have many degrees of freedom, which makes them extremely versatile and complex to control. This report presents a modular snake robot, its electronic architecture and control. Inspired by a biological snake, snake robot moves using cyclic motions called gaits. These cyclic motions directly control the snake robot’s internal degrees of freedom which causes net movement. A sinusoidal oscillator controls each mode of the robot with four parameters: amplitude, frequency, phase, and offset.",
    "imageLink": "projects/snake-bot.png",
    "imageDescription": "Snake Bot"
  },
  {
    "slug": 7,
    "heading": "Solar Powered Unmanned Aerial Vehicle",
    "infoText": "Unmanned Aerial Vehicles, UAV in short, are defined as powered vehicles that can take off, fly and land with no onboard crew. They can either fly remotely (a ground pilot controls the UAV directly) as well as autonomously (it follows a flight path introduced before). In recent years, the level of interest in the development of fixed-wing UAVs for various missions has risen significantly. A crucial issue concerning these aircraft is their high power consumption compared to their limited energy storage capability.",
    "imageLink": "projects/solar-uav.png",
    "imageDescription": "Solar Powered Unmanned Aerial Vehicle"
  },
  {
    "slug": 8,
    "heading": "Universal Gripper",
    "infoText": "A universal gripper acts as the end-effector of any robotic actuator including the robotic arm. The design of a universal gripper requires an in-depth study to identify the mechanisms that may be used, and selection of the most suitable. Once the design is finalized, the manufacturing processes are initiated, and the appropriate components made according to the given specifications. Required changes are made according to the dynamic issues faced in the design and manufacturing. Once the gripper was completed, the testing and analysis of the functionality of the gripper was carried out extensively.",
    "imageLink": "projects/universal-gripper.png",
    "imageDescription": "Universal Gripper"
  },
  {
    "slug": 9,
    "heading": "Interfacing Touch Screen with FGPA",
    "infoText": "The main goal of this project is to interface a touch screen with the FPGA. A resistive four-wire touch screen is used for the same. Texas instrument’s ADS7843 serves as a touch screen controller which converts analog signals from touch screen to digital signal that later is provided as an input to the FPGA. Programming of the FPGA is done in Verilog HDL language. The board is provided with an independent programming platform Quartus II. The serial communication is established between the FPGA and the ADC using SPI serial bus interface.",
    "imageLink": "projects/fpga-touch-screen.jpg",
    "imageDescription": "Interfacing touch screen made with FPGA"
  },
  {
    "slug": 10,
    "heading": "Keyless Door with Home Automation",
    "infoText": "The goal of the project was to implement a smart home system and to receive alerts on movement around restricted premises by controlling the electronic devices at home remotely with a mobile phone. The project could be further extended by using other technologies like radio frequency, Bluetooth technology or the Internet for wireless communication.",
    "imageLink": "projects/keyless-door.png",
    "imageDescription": "Keyless Door Lock"
  },
  {
    "slug": 11,
    "heading": "Road Modelling for Autonomous Vehicles",
    "infoText": "Image processing is a method to convert an image into digital form and perform some operations on it, in order to get an enhanced image or to extract some useful information from it. Usually, Image Processing system includes treating images as two-dimensional signals while applying already set signal processing methods to them. We first import the image with an optical scanner or by digital photography. We then analyze and manipulate the image using data compression, image enhancement, and spotting patterns. Finally, we obtain an output, which can be an altered image or report based on image analysis.",
    "imageLink": "projects/road-modelling-ip.png",
    "imageDescription": "Cars detected by an Image Processing model"
  },
  {
    "slug": 12,
    "heading": "Trajectory Following Robot",
    "infoText": "Here, we assume sensory pose estimation and that a path has been planned, that is consistent with the kinematic constraints of the vehicle. We then go on to develop simple linear state feedback laws and test and augment them for a variety of path complexities. In comparison to many previous systems, the steering control described here is simple, robust and effective due to the position tracking.",
    "imageLink": "projects/trajectory-follow-bot.png",
    "imageDescription": "Working of trajectory following robot"
  },
  {
    "slug": 13,
    "heading": "Maze Solver",
    "infoText": "The problem statement was to navigate a maze and reach the goal in minimum time. The team built a small bot that was manufactured using laser-cut acrylic. A front caster wheel and two rear motor-powered wheels ensured a small turn radius. Three ultrasonic sensors and an Arduino UNO helped the bot detect surrounding walls and stay in the middle of the lane. To keep the ultrasonic sensors concrete in cases of collision, interconnecting and precise fit parts were used. Left-first and backtracking algorithms were used to explore and solve the maze. PID was used to tune the turns and for lane centering of the bot.",
    "imageLink": "projects/maze-solver.jpg",
    "imageDescription": "Maze Solver"
  }
]
